message_values = {
    'wrong_input_error': '''❗️ورودی نامعتبر می باشد❗️''',
    'banned_message': '''⛔️حساب شما توسط ادمین مسدود شده است⛔️''',
    'config_info_message': '👤اطلاعات و آمار اشتراک شما:',
    'telegram_user_info_message': 'آمار و اطلاعات کاربر {full name}',

    'admin_start_menu_message': '🎉به پنل ادمین خوش آمدید🎉',
    'send_new_client_args': '''❗️جهت ساخت کانفیگ جدید، لطفا آرگومان های مورد نیاز را با /new ارسال کنید''',
    'send_message_for_send_to_users': '''❗️پیام مورد نظر خود را جهت ارسال به کاربران بفرستید''',
    'send_config_or_uuid': '❗️ لطفا لینک کانفیگ یا UUID آن را ارسال کنید',

    'send_config_to_get_info': '''❗️جهت دریافت اطلاعات و حجم مصرفی اشتراک خود، لطفا لینک کانفیگ یا UUID آن را ارسال کنید📊''',

    # ----------------------------------

    'vmess_or_uuid_error': '''❌لینک کانفیگ یا UUID به درستی پذیرش نشد❌
❗️لطفا لینک کانفیگ ارسال شده هنگام خرید را ارسال کنید

⭕️ در صورتی که مشکل حل نشد لطفا به پشتیبانی پیام بدید
@Sina8125''',

    'client_name_or_number_error': '❌نام کانفیگ یا شماره آن به درستی پذیرش نشد❌',

    'config_not_found_or_error': '''❗️کانفیگ مورد نظر پیدا نشده یا با مشکلی مواجه شده است❗️
⭕️ لطفا جهت حل مشکل با پشتیبانی در ارتباط باشید
@Sina8125''',

    'problem_error': '''🛑مشکلی به وجود آمده🛑
⭕️لطفا جهت حل مشکل با پشتیبانی در ارتباط باشید
@Sina8125''',

    # ----------------------------------

    'start_menu_message':
        '''سلام {full_name} عزیز👋
به si2ray خوش اومدی🎉

💥سرویس های اختصاصی با ارتباطی پایدار و خدماتی کامل، همراه با بهترین کیفیت و مناسب ترین قیمت را با ما تجربه کنید💥
اینترنت آزاد حق شماست! 🌐🔓

برای ادامه یکی از دکمه های زیر رو انتخاب کن :

➖➖➖➖➖
📌خرید، مشاوره و پشتیبانی:
👤 @Sina8125''',

    # ----------------------------------

    'send_config_for_update': '''❗️برای بروزرسانی کانفیگ، لطفاً لینک کانفیگ یا UUID را ارسال کنید. 🔄

با این اطلاعات، می‌توانیم کانفیگ شما را به‌روز کرده و نسخه جدید را برایتان ارسال کنیم تا تجربه بهتری را برای شما به ارمغان بیاوریم. 🚀''',

    # ----------------------------------

    'config_update_message': '''Hamrahaval:

`{config1}`

~~~~~~~~~~~~~~~~~~~~~
Irancell:

`{config2}`

(روی کانفیگ بزنید کپی میشه)
نام اشتراک: {client_name}

🛑 کانفیگ های قبلی خود را به هیچ عنوان حذف نکنید در صورت نیاز ممکن است کانفیگ ها به حالت قبل برگردد
🛑 هر دو کانفیگ را بدون توجه به اپراتور(همراه اول یا ایرانسل) تست کنید و هرکدام سرعت بهتری داشت استفاده کنید
🛑 هر موقع که کانفیگ ها ضعیف یا قطع شدن ابتدا از طریق ربات، کانفیگ جدید دریافت و تست کنید
🛑 در صورتی که مشکلی داشتید به آی دی زیر پیام بدید

@Sina8125''',

    # ----------------------------------
    'new_config_message': '''Hamrahaval:

`{config1}`

~~~~~~~~~~~~~~~~~~~~~
Irancell:

`{config2}`

(روی کانفیگ بزنید کپی میشه)
نام اشتراک: {client_name}
تاریخ اتمام: {expire_time_ad} | {expire_time_solar}
تعداد کاربر: {ip_limit}
حجم: {total_flow}
قیمت: {price} هزارتومان

🛑 هر دو کانفیگ را بدون توجه به اپراتور(همراه اول یا ایرانسل) تست کنید و هرکدام سرعت بهتری داشت استفاده کنید
🛑 حتما یک بار وارد ربات شوید و گزینه شروع یا استارت را بزنید؛ اطلاع رسانی ها از طریق ربات صورت می‌گیرد
🛑 هر موقع که کانفیگ ها ضعیف یا قطع شدن ابتدا از طریق ربات زیر، کانفیگ جدید دریافت و تست کنید
🛑 با ارسال یکی از کانفیگ های بالا در بخش "آمار و اطلاعات کانفیگ" در ربات، میتوانید آمار و اطلاعات و حجم مصرفی خود را مشاهده کنید

⭕️**ربات: @Si2raybot**⭕️


🛑 در صورتی که مشکلی داشتید به آی دی زیر پیام بدید
@Sina8125''',

    # ----------------------------------

}

button_values = {
    'back_to_main_menu': '🏠 بازگشت به منو اصلی',
    'get_config_info': '💡 آمار و اطلاعات کانفیگ',
    'get_updated_config': '🔄 بروزرسانی کانفیگ',

    'create_new_config': '🛠 ساخت کانفیگ جدید',
    'renewal_config': '♻️ تمدید کانفیگ',
    'send_message_to_users': '📤 ارسال پیام به کاربران',

    'admin_panel': '⚙️ پنل مدیریت',
    'user_panel': '👤 پنل کاربر',
}
