message_values = {
    'start_menu_message': '🎉به پنل ادمین خوش آمدید🎉',
    'wrong_input_error': '''❗️ورودی نامعتبر می باشد❗️''',
    'send_new_client_args': '''❗️جهت ساخت کانفیگ جدید، لطفا آرگومان های مورد نیاز را با /new ارسال کنید''',
    'new_config_message': '''Hamrahaval:

```
{config1}
```

~~~~~~~~~~~~~~~~~~~~~
Irancell:

```
{config2}
```

(روی کانفیگ بزنید کپی میشه)
نام اشتراک: {client_name}
تاریخ اتمام: {expire_time_ad} | {expire_time_solar}
تعداد کاربر: {ip_limit}
حجم: {total_flow}
قیمت: {price} هزارتومان

🛑 هر دو کانفیگ را بدون توجه به اپراتور(همراه اول یا ایرانسل) تست کنید و هرکدام سرعت بهتری داشت استفاده کنید
🛑 حتما یک بار وارد ربات شوید و گزینه شروع یا استارت را بزنید؛ اطلاع رسانی ها از طریق ربات صورت می‌گیرد
🛑 هر موقع که کانفیگ ها ضعیف یا قطع شدن ابتدا از طریق ربات زیر، کانفیگ جدید دریافت و تست کنید
🛑 با ارسال یکی از کانفیگ های بالا در بخش "آمار و اطلاعات کانفیگ" در ربات، میتوانید آمار و اطلاعات و حجم مصرفی خود را مشاهده کنید

⭕️**ربات: @Si2raybot**⭕️


🛑 در صورتی که مشکلی داشتید به آی دی زیر پیام بدید


@Sina8125''',
    'send_message_for_send_to_users': '''❗️پیام مورد نظر خود را جهت ارسال به کاربران بفرستید''',
    'config_not_found_or_error': '''❗️کانفیگ مورد نظر پیدا نشده یا با مشکلی مواجه شده است❗️
⭕️ لطفا جهت حل مشکل با پشتیبانی در ارتباط باشید
@Sina8125''',
}

button_values = {
    'create_new_config': '🛠 ساخت کانفیگ جدید',
    'back_to_main_menu': '🏠 بازگشت به منو اصلی',
    'user_panel': '👤 پنل کاربر',
    'send_message_to_users': '📤 ارسال پیام به کاربران'
}
